IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280013x_gpio_data_regs.xml
<module id="GPIO_DATA_REGS" HW_revision="" description="GPIO DATA Registers">
	<register id="GPADAT" width="32" page="1" offset="0x0" internal="0" description="GPIO A Data Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Data Register for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Data Register for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Data Register for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPASET" width="32" page="1" offset="0x2" internal="0" description="GPIO A Data Set Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Output Set bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Output Set bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Output Set bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Output Set bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Output Set bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Output Set bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Output Set bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Output Set bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Output Set bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Output Set bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Output Set bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Output Set bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPACLEAR" width="32" page="1" offset="0x4" internal="0" description="GPIO A Data Clear Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Output Clear bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Output Clear bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Output Clear bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Output Clear bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Output Clear bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Output Clear bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Output Clear bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Output Clear bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Output Clear bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Output Clear bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Output Clear bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Output Clear bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Output Clear bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Output Clear bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPATOGGLE" width="32" page="1" offset="0x6" internal="0" description="GPIO A Data Toggle Register (GPIO0 to 31) ">
		<bitfield id="GPIO0" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Output Toggle bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Output Toggle bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Output Toggle bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Output Toggle bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Output Toggle bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Output Toggle bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Output Toggle bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Output Toggle bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Output Toggle bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Output Toggle bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Output Toggle bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Output Toggle bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Output Toggle bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Output Toggle bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Output Toggle bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBDAT" width="32" page="1" offset="0x8" internal="0" description="GPIO B Data Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBSET" width="32" page="1" offset="0xa" internal="0" description="GPIO B Data Set Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBCLEAR" width="32" page="1" offset="0xc" internal="0" description="GPIO B Data Clear Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBTOGGLE" width="32" page="1" offset="0xe" internal="0" description="GPIO B Data Toggle Register (GPIO32 to 63) ">
		<bitfield id="GPIO32" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Output Toggle bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHDAT" width="32" page="1" offset="0x38" internal="0" description="GPIO H Data Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHSET" width="32" page="1" offset="0x3a" internal="0" description="GPIO H Data Set Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCLEAR" width="32" page="1" offset="0x3c" internal="0" description="GPIO H Data Clear Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHTOGGLE" width="32" page="1" offset="0x3e" internal="0" description="GPIO H Data Toggle Register (GPIO224 to 255) ">
		<bitfield id="GPIO224" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
</module>
